var x = prompt('Введите время в цифрах');
if (x == 12) {
    alert('12 часов дня');
}
if (x == 13) {
    alert('13 часов дня');
}
if (x == 14) {
    alert('14 часов дня');
}
if (x == 15) {
    alert('15 часов дня');
}
if (x == 16) {
    alert('16 часов дня');
}
if (x == 17) {
    alert('17 часов дня');
}
if (x == 18) {
    alert('18 часов вечера');
}
if (x == 19) {
    alert( '19 часов вечера');
}
if (x == 20) {
alert('20 часов вечера');
}
if (x == 21) {
    alert('21 часов ночи');
}
if (x == 22) {
    alert('22 часов ночи');
}
if (x == 23) {
    alert('23 часов ночи');
}
if (x == 24) {
    alert('24 часов ночи');
}
if (x == 1) {
    alert('1 часов ночи');
}
if (x == 2) {
    alert('2 часов ночи');
}
if (x == 3) {
    alert('3 часов ночи');
}
if (x == 4) {
    alert('4 часов ночи');
}
if (x == 5) {
    alert('5 часов утра');
}
if (x == 6) {
    alert(' 6 часов утра');}
if (x == 7) {
    alert('7 часов утра');
}
if (x == 8) {
    alert('8 часов утра');
}
if (x == 9) {
    alert('9 часов утра');
}
if (x == 10) {
    alert('10 часов дня');
}
if (x == 11) {
    alert('11 часов дня');
}